---
type: FamilyThermalProperties
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# FamilyThermalProperties

`Autodesk.Revit.DB.FamilyThermalProperties` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FamilyThermalProperties | 2013 | `public FamilyThermalProperties ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Find | 2013 | `public static FamilyThermalProperties Find ( Document pADoc , string constructionId )` |
| Method | IsValid | 2015 | `public bool IsValid ()` |
| Property | AnalyticConstructionName | 2013 | `public string AnalyticConstructionName { get ; }` |
| Property | AnalyticConstructionTypeId | 2013 | `public string AnalyticConstructionTypeId { get ; }` |
| Property | HeatTransferCoefficient | 2013 | `public double HeatTransferCoefficient { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SolarHeatGainCoefficient | 2013 | `public double SolarHeatGainCoefficient { get ; }` |
| Property | ThermalResistance | 2013 | `public double ThermalResistance { get ; }` |
| Property | VisualLightTransmittance | 2013 | `public double VisualLightTransmittance { get ; }` |